# Практическая №2
# Даны целые положительные числа A и B (A > B). На отрезке длины A размещено максимально возможное количество отрезков
# длины B (без наложений). Используя операцию деления на цело, найти количество отрезков B, размещённых на отрезке A.
print('Количество полных B в A:', int(int(input()) / int(input())))  # Ввод-вывод и деление нацело
